Structural Applications/Low_Rise_Urban_Canyon/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        offset          (0 0 0);
          setAverage      off;
      //  type            turbulentDFSEMInlet;
       // delta           1;
       // nCellPerEddy    3;
        //mapMethod       nearestCell;
       //value            $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    wallup
    {
        type            symmetry;
    }

    rc
    {
        type            noSlip;
    }

    cylinder
    {
        type            noSlip;
    }


   walldown
    {
        type           symmetry;
    }
    lid  
     {
       type            symmetry;
     }
}


// ************************************************************************* //
