Structural Applications/Low_Rise_Urban_Canyon/system/probesTPU
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            (sampling);
writeControl    timeStep;
writeInterval   1;

fields
(
    p
);

probeLocations
(
  (	1.2668	0.9275	0.0301	)
  (	1.2668	0.9225	0.0301	)
  (	1.2668	0.9175	0.0301	)
  (	1.2668	0.9125	0.0301	)
  (	1.2668	0.9075	0.0301	)
  (	1.2668	0.9025	0.0301	)
  (	1.2668	0.8975	0.0301	)
  (	1.2668	0.8925	0.0301	)
  (	1.2668	0.8875	0.0301	)
  (	1.2668	0.8825	0.0301	)
  (	1.2668	0.8775	0.0301	)
  (	1.2668	0.8725	0.0301	)
  (	1.2618	0.9275	0.0301	)
  (	1.2618	0.9225	0.0301	)
  (	1.2618	0.9175	0.0301	)
  (	1.2618	0.9125	0.0301	)
  (	1.2618	0.9075	0.0301	)
  (	1.2618	0.9025	0.0301	)
  (	1.2618	0.8975	0.0301	)
  (	1.2618	0.8925	0.0301	)
  (	1.2618	0.8875	0.0301	)
  (	1.2618	0.8825	0.0301	)
  (	1.2618	0.8775	0.0301	)
  (	1.2618	0.8725	0.0301	)
  (	1.2568	0.9275	0.0301	)
  (	1.2568	0.9225	0.0301	)
  (	1.2568	0.9175	0.0301	)
  (	1.2568	0.9125	0.0301	)
  (	1.2568	0.9075	0.0301	)
  (	1.2568	0.9025	0.0301	)
  (	1.2568	0.8975	0.0301	)
  (	1.2568	0.8925	0.0301	)
  (	1.2568	0.8875	0.0301	)
  (	1.2568	0.8825	0.0301	)
  (	1.2568	0.8775	0.0301	)
  (	1.2568	0.8725	0.0301	)
  (	1.2518	0.9275	0.0301	)
  (	1.2518	0.9225	0.0301	)
  (	1.2518	0.9175	0.0301	)
  (	1.2518	0.9125	0.0301	)
  (	1.2518	0.9075	0.0301	)
  (	1.2518	0.9025	0.0301	)
  (	1.2518	0.8975	0.0301	)
  (	1.2518	0.8925	0.0301	)
  (	1.2518	0.8875	0.0301	)
  (	1.2518	0.8825	0.0301	)
  (	1.2518	0.8775	0.0301	)
  (	1.2518	0.8725	0.0301	)
  (	1.2468	0.9275	0.0301	)
  (	1.2468	0.9225	0.0301	)
  (	1.2468	0.9175	0.0301	)
  (	1.2468	0.9125	0.0301	)
  (	1.2468	0.9075	0.0301	)
  (	1.2468	0.9025	0.0301	)
  (	1.2468	0.8975	0.0301	)
  (	1.2468	0.8925	0.0301	)
  (	1.2468	0.8875	0.0301	)
  (	1.2468	0.8825	0.0301	)
  (	1.2468	0.8775	0.0301	)
  (	1.2468	0.8725	0.0301	)
  (	1.2418	0.9275	0.0301	)
  (	1.2418	0.9225	0.0301	)
  (	1.2418	0.9175	0.0301	)
  (	1.2418	0.9125	0.0301	)
  (	1.2418	0.9075	0.0301	)
  (	1.2418	0.9025	0.0301	)
  (	1.2418	0.8975	0.0301	)
  (	1.2418	0.8925	0.0301	)
  (	1.2418	0.8875	0.0301	)
  (	1.2418	0.8825	0.0301	)
  (	1.2418	0.8775	0.0301	)
  (	1.2418	0.8725	0.0301	)
  (	1.2368	0.9275	0.0301	)
  (	1.2368	0.9225	0.0301	)
  (	1.2368	0.9175	0.0301	)
  (	1.2368	0.9125	0.0301	)
  (	1.2368	0.9075	0.0301	)
  (	1.2368	0.9025	0.0301	)
  (	1.2368	0.8975	0.0301	)
  (	1.2368	0.8925	0.0301	)
  (	1.2368	0.8875	0.0301	)
  (	1.2368	0.8825	0.0301	)
  (	1.2368	0.8775	0.0301	)
  (	1.2368	0.8725	0.0301	)
  (	1.2318	0.9275	0.0301	)
  (	1.2318	0.9225	0.0301	)
  (	1.2318	0.9175	0.0301	)
  (	1.2318	0.9125	0.0301	)
  (	1.2318	0.9075	0.0301	)
  (	1.2318	0.9025	0.0301	)
  (	1.2318	0.8975	0.0301	)
  (	1.2318	0.8925	0.0301	)
  (	1.2318	0.8875	0.0301	)
  (	1.2318	0.8825	0.0301	)
  (	1.2318	0.8775	0.0301	)
  (	1.2318	0.8725	0.0301	)
  (	1.2668	0.9301	0.0275	)
  (	1.2618	0.9301	0.0275	)
  (	1.2568	0.9301	0.0275	)
  (	1.2518	0.9301	0.0275	)
  (	1.2468	0.9301	0.0275	)
  (	1.2418	0.9301	0.0275	)
  (	1.2368	0.9301	0.0275	)
  (	1.2318	0.9301	0.0275	)
  (	1.2668	0.9301	0.0225	)
  (	1.2618	0.9301	0.0225	)
  (	1.2518	0.9301	0.0225	)
  (	1.2418	0.9301	0.0225	)
  (	1.2318	0.9301	0.0225	)
  (	1.2668	0.9301	0.0175	)
  (	1.2568	0.9301	0.0175	)
  (	1.2468	0.9301	0.0175	)
  (	1.2368	0.9301	0.0175	)
  (	1.2318	0.9301	0.0175	)
  (	1.2668	0.9301	0.0125	)
  (	1.2618	0.9301	0.0125	)
  (	1.2518	0.9301	0.0125	)
  (	1.2418	0.9301	0.0125	)
  (	1.2318	0.9301	0.0125	)
  (	1.2668	0.9301	0.0075	)
  (	1.2568	0.9301	0.0075	)
  (	1.2468	0.9301	0.0075	)
  (	1.2368	0.9301	0.0075	)
  (	1.2318	0.9301	0.0075	)
  (	1.2668	0.9301	0.0025	)
  (	1.2618	0.9301	0.0025	)
  (	1.2518	0.9301	0.0025	)
  (	1.2418	0.9301	0.0025	)
  (	1.2318	0.9301	0.0025	)
  (	1.2291	0.9275	0.0275	)
  (	1.2291	0.9225	0.0275	)
  (	1.2291	0.9175	0.0275	)
  (	1.2291	0.9125	0.0275	)
  (	1.2291	0.9075	0.0275	)
  (	1.2291	0.9025	0.0275	)
  (	1.2291	0.8975	0.0275	)
  (	1.2291	0.8925	0.0275	)
  (	1.2291	0.8875	0.0275	)
  (	1.2291	0.8825	0.0275	)
  (	1.2291	0.8775	0.0275	)
  (	1.2291	0.8725	0.0275	)
  (	1.2291	0.9275	0.0225	)
  (	1.2291	0.9225	0.0225	)
  (	1.2291	0.9125	0.0225	)
  (	1.2291	0.9025	0.0225	)
  (	1.2291	0.8925	0.0225	)
  (	1.2291	0.8825	0.0225	)
  (	1.2291	0.8725	0.0225	)
  (	1.2291	0.9275	0.0175	)
  (	1.2291	0.9175	0.0175	)
  (	1.2291	0.9075	0.0175	)
  (	1.2291	0.8975	0.0175	)
  (	1.2291	0.8875	0.0175	)
  (	1.2291	0.8775	0.0175	)
  (	1.2291	0.8725	0.0175	)
  (	1.2291	0.9275	0.0125	)
  (	1.2291	0.9225	0.0125	)
  (	1.2291	0.9125	0.0125	)
  (	1.2291	0.9025	0.0125	)
  (	1.2291	0.8925	0.0125	)
  (	1.2291	0.8825	0.0125	)
  (	1.2291	0.8725	0.0125	)
  (	1.2291	0.9275	0.0075	)
  (	1.2291	0.9175	0.0075	)
  (	1.2291	0.9075	0.0075	)
  (	1.2291	0.8975	0.0075	)
  (	1.2291	0.8875	0.0075	)
  (	1.2291	0.8775	0.0075	)
  (	1.2291	0.8725	0.0075	)
  (	1.2291	0.9275	0.0025	)
  (	1.2291	0.9225	0.0025	)
  (	1.2291	0.9125	0.0025	)
  (	1.2291	0.9025	0.0025	)
  (	1.2291	0.8925	0.0025	)
  (	1.2291	0.8825	0.0025	)
  (	1.2291	0.8725	0.0025	)
  (	1.2318	0.8699	0.0275	)
  (	1.2368	0.8699	0.0275	)
  (	1.2418	0.8699	0.0275	)
  (	1.2468	0.8699	0.0275	)
  (	1.2518	0.8699	0.0275	)
  (	1.2568	0.8699	0.0275	)
  (	1.2618	0.8699	0.0275	)
  (	1.2668	0.8699	0.0275	)
  (	1.2318	0.8699	0.0225	)
  (	1.2368	0.8699	0.0225	)
  (	1.2468	0.8699	0.0225	)
  (	1.2568	0.8699	0.0225	)
  (	1.2668	0.8699	0.0225	)
  (	1.2318	0.8699	0.0175	)
  (	1.2418	0.8699	0.0175	)
  (	1.2518	0.8699	0.0175	)
  (	1.2618	0.8699	0.0175	)
  (	1.2668	0.8699	0.0175	)
  (	1.2318	0.8699	0.0125	)
  (	1.2368	0.8699	0.0125	)
  (	1.2468	0.8699	0.0125	)
  (	1.2568	0.8699	0.0125	)
  (	1.2668	0.8699	0.0125	)
  (	1.2318	0.8699	0.0075	)
  (	1.2418	0.8699	0.0075	)
  (	1.2518	0.8699	0.0075	)
  (	1.2618	0.8699	0.0075	)
  (	1.2668	0.8699	0.0075	)
  (	1.2318	0.8699	0.0025	)
  (	1.2368	0.8699	0.0025	)
  (	1.2468	0.8699	0.0025	)
  (	1.2568	0.8699	0.0025	)
  (	1.2668	0.8699	0.0025	)
  (	1.2694	0.8725	0.0275	)
  (	1.2694	0.8775	0.0275	)
  (	1.2694	0.8825	0.0275	)
  (	1.2694	0.8875	0.0275	)
  (	1.2694	0.8925	0.0275	)
  (	1.2694	0.8975	0.0275	)
  (	1.2694	0.9025	0.0275	)
  (	1.2694	0.9075	0.0275	)
  (	1.2694	0.9125	0.0275	)
  (	1.2694	0.9175	0.0275	)
  (	1.2694	0.9225	0.0275	)
  (	1.2694	0.9275	0.0275	)
  (	1.2694	0.8725	0.0225	)
  (	1.2694	0.8775	0.0225	)
  (	1.2694	0.8875	0.0225	)
  (	1.2694	0.8975	0.0225	)
  (	1.2694	0.9075	0.0225	)
  (	1.2694	0.9175	0.0225	)
  (	1.2694	0.9275	0.0225	)
  (	1.2694	0.8725	0.0175	)
  (	1.2694	0.8825	0.0175	)
  (	1.2694	0.8925	0.0175	)
  (	1.2694	0.9025	0.0175	)
  (	1.2694	0.9125	0.0175	)
  (	1.2694	0.9225	0.0175	)
  (	1.2694	0.9275	0.0175	)
  (	1.2694	0.8725	0.0125	)
  (	1.2694	0.8775	0.0125	)
  (	1.2694	0.8875	0.0125	)
  (	1.2694	0.8975	0.0125	)
  (	1.2694	0.9075	0.0125	)
  (	1.2694	0.9175	0.0125	)
  (	1.2694	0.9275	0.0125	)
  (	1.2694	0.8725	0.0075	)
  (	1.2694	0.8825	0.0075	)
  (	1.2694	0.8925	0.0075	)
  (	1.2694	0.9025	0.0075	)
  (	1.2694	0.9125	0.0075	)
  (	1.2694	0.9225	0.0075	)
  (	1.2694	0.9275	0.0075	)
  (	1.2694	0.8725	0.0025	)
  (	1.2694	0.8775	0.0025	)
  (	1.2694	0.8875	0.0025	)
  (	1.2694	0.8975	0.0025	)
  (	1.2694	0.9075	0.0025	)
  (	1.2694	0.9175	0.0025	)
  (	1.2694	0.9275	0.0025	)
  

);

// ************************************************************************* //
